7767517
15 15
Input            input.1                  0 1 input.1
Convolution      21                       1 1 input.1 21 0=6 1=3 11=3 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=54
ReLU             22                       1 1 21 22
Pooling          23                       1 1 22 23 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1
Convolution      24                       1 1 23 24 0=16 1=5 11=5 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2400
ReLU             25                       1 1 24 25
Pooling          26                       1 1 25 26 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1
Reshape          34                       1 1 26 34 0=-1
InnerProduct     35                       1 1 34 35 0=120 1=1 2=48000
BatchNorm        38                       1 1 35 38 0=120
ReLU             39                       1 1 38 39
InnerProduct     40                       1 1 39 40 0=84 1=1 2=10080
BatchNorm        43                       1 1 40 43 0=84
ReLU             44                       1 1 43 44
InnerProduct     45                       1 1 44 45 0=10 1=1 2=840
